{
    "version": "https://jsonfeed.org/version/1",
    "title": "Ramblingsinthesky.com",
    "description": "",
    "home_page_url": "https://ramblingsinthesky.com",
    "feed_url": "https://ramblingsinthesky.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Ben Uecker"
    },
    "items": [
        {
            "id": "https://ramblingsinthesky.com/how-to-make-corn-tortillas-from-scratch.html",
            "url": "https://ramblingsinthesky.com/how-to-make-corn-tortillas-from-scratch.html",
            "title": "How to Make Corn Tortillas From Scratch",
            "summary": "Making corn tortillas from scratch is a surprisingly simple process that yields delicious results. This is coming from someone who&hellip;",
            "content_html": "<div class=\"markdown markdown-main-panel\" dir=\"ltr\">\n<p data-sourcepos=\"1:1-1:159\">Making corn tortillas from scratch is a surprisingly simple process that yields delicious results. This is coming from someone who always orders flour when going to a restaurant. </p>\n<p data-sourcepos=\"1:1-1:159\">Masa harina is what you need. Where we live there is a lot more Harina de maiz options than masa harina. Harina de maiz is cornmeal and is popular with Dominicans. Hence, we have lots of Dominicans living here. Harina de Maiz is not interchangeable with masa harina.</p>\n<p data-sourcepos=\"1:1-1:159\">Here's a basic rundown of what you'll need and how to do it:</p>\n<p data-sourcepos=\"3:1-3:16\"><strong>Ingredients:</strong></p>\n<ul data-sourcepos=\"5:1-8:0\">\n<li data-sourcepos=\"5:1-5:231\">2 cups of Masa harina (corn flour): This is a specially treated flour made from dried field corn that's been nixtamalized (cooked in an alkaline solution). You can find it in most grocery stores, usually in the Latin American food section.</li>\n<li data-sourcepos=\"6:1-6:12\">1.5 cups of warm water (room temperature water if you live in a warm climate)</li>\n<li data-sourcepos=\"7:1-8:0\">Teaspoon of salt</li>\n</ul>\n<p data-sourcepos=\"9:1-9:14\"><strong>Equipment:</strong></p>\n<ul data-sourcepos=\"11:1-16:0\">\n<li data-sourcepos=\"11:1-11:13\">Mixing bowl</li>\n<li data-sourcepos=\"12:1-12:15\">Spoon or fork</li>\n<li data-sourcepos=\"13:1-13:24\">Rolling pin (optional)</li>\n<li data-sourcepos=\"14:1-14:52\">Tortilla press (optional, but makes things easier)</li>\n<li data-sourcepos=\"15:1-16:0\">Cast iron skillet or griddle</li>\n</ul>\n<p data-sourcepos=\"17:1-17:17\"><strong>Instructions:</strong></p>\n<ol data-sourcepos=\"19:1-28:0\">\n<li data-sourcepos=\"19:1-20:0\">\n<p data-sourcepos=\"19:4-19:290\"><strong>Mix the dough:</strong> In a large bowl, combine masa harina and salt. Gradually add 1 cup of water, mixing with a spoon or fork. The remaining half of cup you add slowly until a soft dough forms. You might need more or less depending on your climate. 1.5 cups is perfect for my tropical climate. The dough should be slightly sticky but not wet. .</p>\n</li>\n<li data-sourcepos=\"21:1-22:0\"><strong>Portion the dough:</strong> Divide the dough into equal-sized balls, about the size of golf balls.\n<ol data-sourcepos=\"19:1-28:0\">\n<li data-sourcepos=\"21:1-22:0\">Some recipes have you rest the dough for 20-30 minutes. I do not do this.</li>\n<li data-sourcepos=\"21:1-22:0\">One site says it makes 8 corn tortillas. That was not good for me. The tortillas were too thick and they were not plyable. I shoot for 12 tortillas.</li>\n</ol>\n</li>\n<li data-sourcepos=\"25:1-26:0\">\n<p data-sourcepos=\"25:4-25:291\"><strong>Press the tortillas:</strong> Here's where the tortilla press comes in handy. Place a dough ball between two pieces of plastic wrap and press down to form a thin disc. If you don't have a press, you can roll out the dough ball between two sheets of parchment paper to about 1/8-inch thickness. Just get a press. It saves so much time.</p>\n</li>\n<li data-sourcepos=\"27:1-28:0\">\n<p data-sourcepos=\"27:4-27:272\"><strong>Cook the tortillas:</strong> Heat a cast iron skillet or griddle over medium heat. If you are using gas I need to keep mine at low. Place a tortilla in the hot pan for 10 seconds and then flip. This makes it a little more fluffy and cook for about 30-45 seconds per side, or until lightly browned and spotted. You can stack the cooked tortillas in a clean kitchen towel to keep them warm.</p>\n</li>\n</ol>\n<p data-sourcepos=\"29:1-29:9\"><strong>Tips:</strong></p>\n<ul data-sourcepos=\"31:1-35:0\">\n<li data-sourcepos=\"31:1-31:94\">If the dough is too dry, add a little more water by the tablespoon until it becomes pliable.</li>\n<li data-sourcepos=\"32:1-32:95\">If the dough is too sticky, dust your hands with a little masa harina before working with it.</li>\n<li data-sourcepos=\"34:1-35:0\">Freshly made tortillas are best enjoyed warm, but they can also be stored in an airtight container at room temperature for up to 2 days. Reheat them in a skillet or microwave before serving.</li>\n</ul>\n</div>",
            "author": {
                "name": "Ben Uecker"
            },
            "tags": [
                   "corn tortillas"
            ],
            "date_published": "2024-04-21T11:58:56-04:00",
            "date_modified": "2024-04-21T12:04:35-04:00"
        },
        {
            "id": "https://ramblingsinthesky.com/germans-and-their-passive-aggressiveness.html",
            "url": "https://ramblingsinthesky.com/germans-and-their-passive-aggressiveness.html",
            "title": "Germans and Their Passive Aggressiveness",
            "summary": "I was looking for the reason why Mainz was throwing tennis balls on the pitch today. Last time a team&hellip;",
            "content_html": "<p>I was looking for the reason why Mainz was throwing tennis balls on the pitch today. Last time a team did this it had to do with ownership. A Google search led me to this awesomeness:</p>\n<p>Germany 2024: rural youth singing “foreigners out” from a beer-drinking Lego carnival float</p>\n<p>https://twitter.com/i/status/1756276399634059673<a href=\"https://twitter.com/i/status/1756276399634059673\" target=\"_blank\" rel=\"noopener noreferrer\"></a></p>",
            "author": {
                "name": "Ben Uecker"
            },
            "tags": [
            ],
            "date_published": "2024-02-11T10:53:07-04:00",
            "date_modified": "2024-02-11T10:53:07-04:00"
        },
        {
            "id": "https://ramblingsinthesky.com/2023-december-trip-to-new-zealand.html",
            "url": "https://ramblingsinthesky.com/2023-december-trip-to-new-zealand.html",
            "title": "2023 December Trip to New Zealand",
            "summary": "This was our third time to New Zealand and first trip to the South Island. We stayed in Queenstown and&hellip;",
            "content_html": "<p>This was our third time to New Zealand and first trip to the South Island. We stayed in Queenstown and the purpose of the trip was to visit Milford Sound. It is a protected fjord that took several hours to get to. It exceeded our expectations by miles.</p>",
            "author": {
                "name": "Ben Uecker"
            },
            "tags": [
            ],
            "date_published": "2024-01-13T10:52:30-04:00",
            "date_modified": "2024-01-13T10:52:30-04:00"
        },
        {
            "id": "https://ramblingsinthesky.com/a-2013-post-about-our-asian-tiger-mosquitos.html",
            "url": "https://ramblingsinthesky.com/a-2013-post-about-our-asian-tiger-mosquitos.html",
            "title": "A 2013 Post about our Asian Tiger Mosquitos",
            "summary": "We have had several Asian Tiger Mosquitos in our house up to about 2 weeks ago. They are HUGE compared&hellip;",
            "content_html": "<p>We have had several Asian Tiger Mosquitos in our house up to about 2 weeks ago. They are HUGE compared to a normal mosquito. Just learned today from this article in <a href=\"http://www.nbcnews.com/health/cdc-issues-warning-about-painful-virus-mosquitoes-2D11765769\">nbcnews.com</a> that the mosquito may carry the dengue virus. Not only that virus but I guess a new virus from Africa as well. According to the article, <a href=\"http://www.nbcnews.com/health/www.cdc.gov/chikungunya\">Chikungunya virus</a>is also a very painful virus to get. It was found in Sint Maartin.</p>\n<p>I am including a shot of one here but I may have to take a picture with my camera when I see another one. Fortunately, we have lots of geckos in the house and they do an amazing job of eating the bugs.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"http://upload.wikimedia.org/wikipedia/commons/e/ea/Aedes_Albopictus.jpg\" alt=\"Asian Tiger Mosquitos\" width=\"1080\" height=\"733\" data-is-external-image=\"true\"></figure>",
            "author": {
                "name": "Ben Uecker"
            },
            "tags": [
            ],
            "date_published": "2023-08-20T16:58:41-04:00",
            "date_modified": "2023-08-20T16:58:41-04:00"
        },
        {
            "id": "https://ramblingsinthesky.com/a-post-from-2015-about-your-1st-trip-to-new-zealand.html",
            "url": "https://ramblingsinthesky.com/a-post-from-2015-about-your-1st-trip-to-new-zealand.html",
            "title": "A Post from 2015 about your 1st Trip to New Zealand",
            "summary": "Note: This post is originally from 3/24/2015 and is from my ruined Ghost blog. I am reposting some of the&hellip;",
            "content_html": "<p>Note: This post is originally from 3/24/2015 and is from my ruined Ghost blog. I am reposting some of the original content. I thought it would be fun to keep this one. We are going back to New Zealand for our 3rd time. This coming trip will be spent in Queenstown on the South Island.</p>\n<p>This is just a short blurb about vacation. We recently got back from visiting Phoenix, Los Angeles, Tahiti, and Auckland, New Zealand.</p>\n<ol>\n<li>Tahiti was beautiful but not that much different than our own Caribbean islands. We went to Moorea for a day trip and that island is just stunning.</li>\n<li>Getting to see even just one spring training game is awesome. I'm glad we go every year. This year we had to be at LAX the next day to fly out and so we drove to Los Angeles. The sunset was amazing. TuneIn radio worked 95% of the time and I would highly recommend it but just once.</li>\n<li>New Zealand was even more beautiful than I expected and Auckland was an extremely modern city. I got to try a Flat White for the first time and just fell in love with the drink. We also went to Wahiki island off of Auckland and that provided us with even more beauty. Especially since we walked most of it. The wineries everywhere were top-notch.</li>\n<li>A layover in Tahiti and Los Angeles on the way back wasn't too bad. In Tahiti, they took my travel corkscrew. First time in over 5 years I have had it taken on me and this was obviously my 2nd time in that airport! For Los Angeles, we just drove around near the water and checked out some of the scenery.</li>\n</ol>\n<p>I think sums it up. I have some amazing pictures and memories and very happy to have had the opportunity to take this trip.</p>",
            "author": {
                "name": "Ben Uecker"
            },
            "tags": [
            ],
            "date_published": "2023-08-20T16:56:32-04:00",
            "date_modified": "2023-08-20T16:56:32-04:00"
        },
        {
            "id": "https://ramblingsinthesky.com/an-intro-i-wrote-about-my-first-issues-with-ghost-blog-in-2013.html",
            "url": "https://ramblingsinthesky.com/an-intro-i-wrote-about-my-first-issues-with-ghost-blog-in-2013.html",
            "title": "An Intro I wrote about My First Issues with Ghost Blog in 2013",
            "summary": "Well, I just wrote over 2 pages of text and it was all wiped out by an accidental slip of&hellip;",
            "content_html": "<p>Well, I just wrote over 2 pages of text and it was all wiped out by an accidental slip of the mouse button. Guess there is no auto-save feature? I will have to check that out.</p>\n<p>Lets see if I can shorten this:</p>\n<p>Ghost is a new blogging platform and I didn't really have the time (I technically still don't) to try and install it. It has taken a solid 1.5 hours to get it up and running on my little server but it seems to be working.</p>\n<p>There are 2 possible issues. The first is I am not sure if I am saving this in mysql or sqlite. It is suppose to be mysql. The second is the upstart functionality. When I reboot my server I can't seem to verify ghost will restart. Again, this is something I will have to test later.</p>\n<p>Lastly, this is being housed on an atom server running on Ubuntu 13.10.</p>\n<p>I repurposed an Acer Veriton with an atom processor. Replaced the expensive fan and added an SSD and doubled the memory. It also serves as a remote desktop host with virtualbox running an XP guest. I also occasionally use it to stream video to the TV. It sits behind the TV and is silent. You may think that putting an SSD in it is overkill but when you are paying 52.5 cents (soon to go up another 2.5 cents) per Kwh you would also be doing everything to reduce your electricity costs.</p>",
            "author": {
                "name": "Ben Uecker"
            },
            "tags": [
            ],
            "date_published": "2023-08-20T16:53:08-04:00",
            "date_modified": "2023-08-20T16:53:08-04:00"
        },
        {
            "id": "https://ramblingsinthesky.com/hisense-soundbar-firmware.html",
            "url": "https://ramblingsinthesky.com/hisense-soundbar-firmware.html",
            "title": "Hisense Soundbar Firmware",
            "summary": "I never found any Hisense soundbar firmware but I did find a reddit post on how to factory reset the&hellip;",
            "content_html": "<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://blog-pics.s3.amazonaws.com/ramblings/Hisense-soundbar.png\" alt=\"Hisense Sondbar\" width=\"997\" height=\"264\" data-is-external-image=\"true\"></figure>\n<p>I never found any Hisense soundbar firmware but I did find a reddit post on how to factory reset the sound bar. Volume Down + Power. Hold it down until the light starts to flash.</p>\n<p>My soundbar had two issues. The Hisense Soundbar would not turn off and after a few minutes it went super quiet. I did the standard troubleshooting and then opened a ticket with Hisense. It took them just a day or two to send a text message asking for a pic of the label. I originally did the chat support.</p>\n<p>A week goes by and I reach out to them again. They say I have to ship it in. I did not have the original box but I did find a box it would fit in. However, it would have cost me close to $30 to ship it out.</p>\n<p>The positive of this situation is either 1. don't buy hisense again (our tv is hisense also) or 2. thank heavens I don't have to pay to ship it back to get it fixed.</p>\n<p>The negative is that Hisense support should have suggested I hit those two buttons. They did ask me to unplug and plug it back in.  This is huge mistake on their part. It would have cost them time and money to press those two buttons and ship it back. You know that's all they would have done.</p>\n<p>The old saying \"You get what you paid for\" lives on. Here is verifiable proof.</p>",
            "image": "https://ramblingsinthesky.com/media/posts/12/Hisense-soundbar.png",
            "author": {
                "name": "Ben Uecker"
            },
            "tags": [
            ],
            "date_published": "2023-08-19T14:22:02-04:00",
            "date_modified": "2023-08-20T16:39:51-04:00"
        },
        {
            "id": "https://ramblingsinthesky.com/austin-fc-should-care-more-about-tournaments.html",
            "url": "https://ramblingsinthesky.com/austin-fc-should-care-more-about-tournaments.html",
            "title": "Austin FC Should Care More About Tournaments",
            "summary": "Just a gripe. I would like to see Austin FC care more about tournaments. First game of Leagues Cup and&hellip;",
            "content_html": "<p>Just a gripe. I would like to see Austin FC care more about tournaments. First game of Leagues Cup and they lose easily. For the Concacaf tournament they lost to a bunch of part time footballers in Haiti. That's awful.</p>",
            "author": {
                "name": "Ben Uecker"
            },
            "tags": [
            ],
            "date_published": "2023-07-23T17:52:59-04:00",
            "date_modified": "2023-07-23T17:52:59-04:00"
        },
        {
            "id": "https://ramblingsinthesky.com/watchi.html",
            "url": "https://ramblingsinthesky.com/watchi.html",
            "title": "Cold Brew Season is Here!",
            "summary": "I am sure there are plenty of people who say all year is cold brew season. Living in the tropics&hellip;",
            "content_html": "<p>I am sure there are plenty of people who say all year is cold brew season. Living in the tropics I could agree with that but I definitely make more when it is hot out. Especially with El Nino being back. Our lows have been around 80 for a month now. That should not happen until August/September. </p>\n<p>What I do for my cold brew is use a cotton bag and make a mason jar worth of cold brew. I leave it to sit in the kitchen for around 20 hours. Three days worth goes to work with me on Monday and the rest is either drank by the wife or saved for the weekend.</p>\n<p>I vary my recipe based on what I have. When I would make 10 gallons for special events I did a ratio of sweet, nutty and chocolatey.  PNG, Ethiopian, Brazil, Colombian and Guatamela are the usual countries. Currently, I have been using Mexican Chiapas, Ethiopian Yirgacheffe and/or Colombian. The Chiapas I have right now is last season's crop. Got a great price on it. I can't taste the difference when using it in cold brew.</p>\n<p>Enjoy a cold brew in this hot summer!</p>",
            "author": {
                "name": "Ben Uecker"
            },
            "tags": [
            ],
            "date_published": "2023-06-25T11:24:17-04:00",
            "date_modified": "2023-06-25T11:33:56-04:00"
        },
        {
            "id": "https://ramblingsinthesky.com/razer-nabu-looks-like-the-most-interesting-band-at-ces.html",
            "url": "https://ramblingsinthesky.com/razer-nabu-looks-like-the-most-interesting-band-at-ces.html",
            "title": "Razer Nabu Looks Like the Most Interesting Band at CES",
            "summary": "Originally published January 8, 2014. I've been tracking the fitness band announcements at CES this year. I currently have a&hellip;",
            "content_html": "<p>Originally published January 8, 2014.</p>\n<p>I've been tracking the fitness band announcements at CES this year. I currently have a fitbit flex which is a hand-me-down. I bought one for my wife this past September and she just gave it to me after their company bought one for all their employees.</p>\n<p>I like it but I don't like that we will be on our 3rd fitbit flex in just 3 full months. The one my wife got is also defective.</p>\n<p><a href=\"http://www.razerzone.com/nabu\">http://www.razerzone.com/nabu</a></p>\n<p>5/2/2022</p>\n<p>I've gone through three Wyze fitness bands and 2 Wzye watches since then. I've been on the lookout for another fitness band for months. I am at a loss!</p>",
            "author": {
                "name": "Ben Uecker"
            },
            "tags": [
            ],
            "date_published": "2023-05-02T19:45:33-04:00",
            "date_modified": "2023-05-02T19:45:33-04:00"
        }
    ]
}
